<unk>	0
<s>	0
</s>	0
▁=	-3.27283
▁i	-3.67522
,	-3.68411
▁"	-3.69852
;	-3.72048
▁n	-3.76026
▁(	-3.81459
[	-3.83405
▁a	-3.99206
i	-3.99956
▁to	-4.10399
▁if	-4.16477
▁<<	-4.2088
]	-4.25135
▁{	-4.34045
"	-4.46232
▁for	-4.51818
▁>>	-4.54311
▁s	-4.56967
▁-	-4.60212
)	-4.60306
▁long	-4.61136
▁+	-4.61229
▁0	-4.61765
int	-4.6645
;"	-4.6834
▁is	-4.68729
▁b	-4.68858
▁int	-4.71346
▁and	-4.73094
▁1	-4.80637
▁x	-4.87402
▁else	-4.87757
(	-4.98191
▁j	-4.98445
▁m	-4.98491
▁cin	-5.05086
▁of	-5.0614
n	-5.06237
▁print	-5.06256
▁0;	-5.0646
▁k	-5.06881
▁c	-5.06927
▁read	-5.08824
▁<	-5.10001
▁""	-5.11301
▁ans	-5.1192
▁==	-5.12495
▁endl	-5.17626
++)	-5.19578
▁*	-5.26492
▁integer	-5.27215
▁set	-5.32079
1	-5.35315
j	-5.37308
a	-5.384
▁	-5.39037
▁with	-5.42314
▁cout	-5.42771
▁t	-5.47293
""	-5.48564
▁y	-5.50036
.	-5.54324
2	-5.54411
▁2	-5.54467
▁1;	-5.5616
▁/	-5.56623
▁}	-5.60281
▁exclusive	-5.62707
▁sum	-5.68051
s	-5.69478
cout	-5.70329
▁increment	-5.7788
if	-5.7817
▁d	-5.80347
▁<=	-5.80405
▁p	-5.83011
▁%	-5.83871
▁the	-5.87225
▁create	-5.87861
▁while	-5.90935
▁than	-5.92777
x	-5.93162
▁l	-5.96038
▁equal	-5.96239
▁return	-5.98743
▁v	-5.99811
▁r	-6.00783
▁by	-6.03545
print	-6.08131
▁>	-6.08472
];	-6.10193
▁'	-6.11051
_	-6.1204
▁0)	-6.14199
▁integers	-6.14534
▁1)	-6.1468
▁string	-6.16432
▁&	-6.18172
][	-6.21442
++;	-6.21529
▁size	-6.23814
▁arr	-6.2487
▁from	-6.24903
▁0,	-6.25535
▁+=	-6.26133
▁cnt	-6.26287
for	-6.27467
&	-6.27765
long	-6.29551
▁array	-6.30091
▁new	-6.33466
▁declare	-6.3428
▁be	-6.36616
▁newline	-6.3782
b	-6.38964
▁value	-6.44824
▁inclusive	-6.46548
[0]	-6.47402
▁min	-6.48309
▁!=	-6.50452
▁let	-6.50782
▁1]	-6.51543
=	-6.52465
▁f	-6.52631
▁max	-6.52809
▁greater	-6.53111
k	-6.56115
"""	-6.58661
'	-6.59213
3	-6.59278
▁>=	-6.59582
▁or	-6.59972
▁break	-6.63002
▁loop	-6.63302
▁true	-6.64202
▁less	-6.66385
O	-6.66564
▁num	-6.71144
e	-6.71634
▁count	-6.74497
▁res	-6.74593
▁flag	-6.74781
);	-6.76228
t	-6.7649
1,	-6.78672
d	-6.82045
▁str	-6.82672
create	-6.83021
f	-6.83225
c	-6.83402
▁not	-6.83439
size	-6.83914
▁3	-6.845
▁q	-6.85352
ing	-6.85586
NO	-6.86026
();	-6.87136
▁temp	-6.87261
m	-6.88329
▁line	-6.88748
y	-6.92007
()	-6.93763
read	-6.95937
▁then	-6.98242
])	-6.98315
YES	-6.9878
▁10	-6.99601
[1]	-7.02128
▁input	-7.02646
▁2;	-7.04545
▁z	-7.05129
▁2)	-7.05921
▁const	-7.06513
▁length	-7.06879
<	-7.07185
▁decrement	-7.08253
▁false	-7.09455
▁w	-7.10442
▁function	-7.12561
>	-7.14126
▁0"	-7.15539
\	-7.16231
declare	-7.17286
▁N	-7.17408
p	-7.19188
▁++	-7.20042
▁char	-7.22312
=0	-7.22359
▁vector	-7.22435
l	-7.23569
▁1,	-7.24254
||	-7.25672
▁h	-7.2575
▁-1	-7.27751
▁""\	-7.27912
▁do	-7.28892
▁mod	-7.2992
ans	-7.30621
string	-7.31894
o	-7.32469
]"	-7.32564
▁increase	-7.34737
▁assign	-7.35677
r	-7.37298
▁change	-7.39357
▁modulo	-7.3955
▁variable	-7.39705
▁4	-7.39982
▁len	-7.40167
▁dp	-7.42503
▁add	-7.43224
▁5	-7.45768
▁ch	-7.46122
v	-7.47399
▁A	-7.48402
▁bool	-7.51969
▁in	-7.52538
))	-7.55254
▁following	-7.55351
▁as	-7.57215
▁'\	-7.57439
▁e	-7.57666
▁abs	-7.57801
')	-7.57989
▁g	-7.58273
▁u	-7.58319
let	-7.59069
--)	-7.59865
▁tmp	-7.60611
2,	-7.60974
▁result	-7.63957
▁((	-7.64688
▁{"	-7.6473
▁character	-7.72151
[2]	-7.72362
length	-7.72368
▁elements	-7.73479
▁7	-7.76167
▁one	-7.76476
▁constant	-7.77358
▁gcd	-7.7762
';	-7.78668
push	-7.79046
▁arguments	-7.79504
--;	-7.80115
▁maxn	-7.80897
▁output	-7.80926
▁mx	-7.81097
sum	-7.82679
▁end	-7.82716
▁-=	-7.8296
sort	-7.82982
back	-7.83268
▁1"	-7.84498
cin	-7.84591
arr	-7.84918
▁st	-7.85174
▁element	-7.8534
▁)	-7.87653
2)	-7.91691
▁sort	-7.926
▁call	-7.93738
▁mp	-7.94725
▁ints	-7.97191
▁continue	-7.98552
▁S	-7.99367
end	-8.00661
-	-8.0103
9	-8.03476
())	-8.03603
str	-8.03717
▁void	-8.04072
▁10;	-8.06444
begin	-8.06871
A	-8.07052
1[	-8.08583
▁3;	-8.09921
"")	-8.11521
0	-8.12457
ed	-8.12573
D	-8.13711
▁an	-8.13792
▁mn	-8.15109
▁pos	-8.15778
(),	-8.16111
▁equals	-8.16218
while	-8.16285
▁double	-8.16929
▁total	-8.16971
)"	-8.1721
▁longs	-8.18833
▁'0'	-8.19202
▁argument	-8.19468
▁1])	-8.1954
=1	-8.19983
▁start	-8.20423
],	-8.21518
▁values	-8.21571
R	-8.22011
▁ar	-8.22108
▁it	-8.22204
set	-8.22296
▁1][	-8.23022
u	-8.23175
▁8	-8.23709
▁M	-8.24058
▁boolean	-8.2515
char	-8.25419
▁strings	-8.25678
▁variables	-8.25966
cnt	-8.26123
▁?	-8.26661
▁run	-8.27802
▁standar	-8.27958
▁(!	-8.28228
▁:	-8.29751
Read	-8.2983
▁B	-8.29849
▁mid	-8.30996
▁first	-8.31591
▁at	-8.32872
return	-8.32999
5	-8.33262
▁vis	-8.3331
▁solve	-8.33472
2;	-8.33775
▁6	-8.33952
2[	-8.34756
▁T	-8.35108
▁MOD	-8.36961
1)	-8.38034
[3]	-8.38509
▁100	-8.38722
▁INF	-8.38998
▁make	-8.39612
max	-8.40237
▁name	-8.40503
q	-8.40661
min	-8.40735
▁-1,	-8.40931
num	-8.40978
▁index	-8.41356
▁absolute	-8.41357
].	-8.42343
▁check	-8.44078
flag	-8.45821
h	-8.46001
▁ok	-8.46303
▁sizeof	-8.46594
z	-8.46737
▁cur	-8.47573
▁o	-8.47724
▁5;	-8.48433
▁NO	-8.48915
▁now	-8.48948
▁decrease	-8.49515
▁last	-8.49648
▁minimum	-8.52953
N	-8.53275
▁that	-8.54091
▁even	-8.57187
]);	-8.57444
▁YES	-8.57676
temp	-8.58112
▁val	-8.58236
second	-8.5872
▁ss	-8.59058
S	-8.6059
▁3)	-8.61605
▁""|	-8.61745
first	-8.62494
▁maximum	-8.63712
-1]	-8.64623
in	-8.6622
▁counter	-8.66864
▁|	-8.68512
▁R	-8.68646
▁1000	-8.6882
▁arrays	-8.69878
▁C	-8.70421
▁are	-8.70502
▁4;	-8.70998
▁maxx	-8.7128
▁swap	-8.7131
▁append	-8.72695
▁ret	-8.7295
res	-8.7376
▁map	-8.73852
"",	-8.74228
▁L	-8.74318
memset	-8.75155
L	-8.75393
B	-8.75641
w	-8.75737
else	-8.75905
2"	-8.76068
abs	-8.76907
pos	-8.77037
][0]	-8.77233
MAX	-8.77648
T	-8.7772
map	-8.77724
',	-8.78535
▁1))	-8.80156
▁inf	-8.80606
▁1);	-8.80736
LL	-8.81111
count	-8.8127
▁stop	-8.81522
ch	-8.81861
▁prime	-8.82021
▁2,	-8.82045
▁second	-8.82244
1;	-8.82475
▁user	-8.83421
▁-1;	-8.84787
g	-8.85093
-----------	-8.85331
▁tot	-8.85431
▁push	-8.85613
']	-8.86449
insert	-8.87315
4	-8.87324
+	-8.87364
▁all	-8.88226
▁1];	-8.88747
▁MAX	-8.89003
▁INT	-8.89297
▁vec	-8.90044
▁7;	-8.91117
▁otherwise	-8.9152
[4]	-8.91772
▁105	-8.9234
▁getchar	-8.92788
▁insert	-8.94392
▁characters	-8.94946
▁define	-8.95323
integers	-8.9545
▁on	-8.97577
+1]	-8.97957
▁cost	-8.98213
▁right	-8.99522
▁left	-9.00082
▁minn	-9.0046
(""	-9.00612
]++;	-9.0075
▁tak	-9.00838
<<	-9.01706
▁'1'	-9.02386
dp	-9.03094
▁dfs	-9.03394
▁""0""	-9.04074
maxn	-9.0462
▁divide	-9.04718
find	-9.05086
-1	-9.05088
array	-9.06492
▁row	-9.0793
▁cont	-9.08042
][1]	-9.08241
integer	-9.08605
▁time	-9.0977
▁times	-9.0983
▁odd	-9.10104
U	-9.10771
*	-9.10951
▁26	-9.12222
▁answer	-9.13175
▁!	-9.13267
▁2]	-9.13334
▁8;	-9.14097
▁MAXN	-9.14758
▁number	-9.15362
▁iteration	-9.15469
▁aux	-9.17098
3,	-9.17599
▁10)	-9.1767
▁each	-9.17673
▁9	-9.18203
▁""+	-9.18368
▁""-1""	-9.18419
▁ct	-9.18777
▁pre	-9.19754
[5]	-9.1988
▁strlen	-9.20243
+1	-9.20767
▁'0')	-9.21208
1.	-9.21979
M	-9.22589
puts	-9.22726
gcd	-9.23814
▁4)	-9.24434
▁ara	-9.24538
vector	-9.24602
▁xx	-9.24844
substr	-9.25953
▁%=	-9.2656
C	-9.26896
▁maxi	-9.28154
▁D	-9.2844
▁pointer	-9.28944
▁5)	-9.29039
▁101	-9.29046
-------------+""	-9.29757
▁curr	-9.30114
▁30	-9.30122
th	-9.30367
pair	-9.30981
▁X	-9.31217
len	-9.31441
▁subtract	-9.3172
▁remove	-9.3189
[0];	-9.32341
▁'0';	-9.32765
▁""#""	-9.32967
tmp	-9.34002
++	-9.34115
▁_	-9.34435
▁diff	-9.35053
▁P	-9.35301
▁next	-9.35519
[0])	-9.35714
▁prev	-9.36078
▁dist	-9.36533
bool	-9.36828
start	-9.37081
▁out	-9.37239
▁-1)	-9.37634
st	-9.38011
6	-9.3804
▁takes	-9.38072
▁'*'	-9.38212
[1])	-9.38381
▁60	-9.38857
▁bitwise	-9.3903
▁20	-9.39071
▁1000000007	-9.39256
▁mark	-9.39465
▁exit	-9.39699
▁col	-9.39818
here	-9.39821
mx	-9.39866
No	-9.40952
▁truthy	-9.41029
▁top	-9.41927
▁between	-9.42047
▁two	-9.42061
Yes	-9.42501
▁initialize	-9.4308
▁inline	-9.43166
1[0]	-9.43457
▁space	-9.44113
getline	-9.44544
▁mini	-9.44597
1++;	-9.4488
▁no	-9.45146
▁different	-9.45159
▁unsigned	-9.45357
/	-9.4719
▁dy	-9.48007
▁current	-9.48714
▁sqrt	-9.48919
▁7)	-9.49082
▁step	-9.49984
--	-9.50051
▁base	-9.50317
cur	-9.50578
▁'-'	-9.5073
▁casted	-9.50949
X	-9.51169
▁'-')	-9.51357
▁Max	-9.51628
▁{0};	-9.52139
I	-9.52178
['	-9.53386
▁reading	-9.53393
mp	-9.53469
▁data	-9.5368
it	-9.53725
P	-9.53758
▁'1')	-9.53863
▁G	-9.53928
▁test	-9.54732
▁down	-9.55167
▁word	-9.56049
double	-9.56511
▁get	-9.57224
..........	-9.57488
▁beginning	-9.57888
vis	-9.58014
0,	-9.58064
▁""1""	-9.58121
IG	-9.58324
▁15	-9.58647
1[1]	-9.59097
▁both	-9.59098
increment	-9.59359
[105];	-9.59742
index	-9.60309
▁6;	-9.61126
▁day	-9.61339
▁ma	-9.61535
▁acos	-9.6165
▁position	-9.62096
▁1005	-9.62157
▁bytes	-9.62416
F	-9.62899
▁rem	-9.63358
▁dx	-9.63383
▁12	-9.63732
());	-9.63817
loop	-9.64746
[0][0]	-9.64949
▁ceil	-9.6508
▁power	-9.65378
▁idx	-9.65675
}	-9.65743
++]	-9.65939
▁pow	-9.66704
▁dis	-9.67307
▁{0}	-9.6746
▁mm	-9.68149
▁cmp	-9.68523
▁'.'	-9.69488
▁__	-9.69593
now	-9.69905
▁find	-9.70022
▁100;	-9.70039
▁empty	-9.70134
((	-9.70292
(0);	-9.70912
▁co	-9.71918
▁110	-9.71931
▁PI	-9.72483
G	-9.72588
▁zero	-9.72964
(0,	-9.72971
void	-9.73781
▁100000	-9.74203
erase	-9.75651
▁pq	-9.76466
▁ind	-9.76785
-|	-9.76939
scissors	-9.76958
rock	-9.77054
3)	-9.77071
function	-9.77132
▁can	-9.77183
▁plus	-9.77233
W	-9.77306
▁100005	-9.77353
▁my	-9.77496
64	-9.77651
paper	-9.77943
▁pair	-9.78074
▁""*""	-9.78125
▁up	-9.78433
▁substring	-9.79357
▁Y	-9.80009
▁1000000007;	-9.80213
[6]	-9.80264
|	-9.80453
▁fa	-9.80593
▁price	-9.8088
get	-9.81069
call	-9.81113
▁""-	-9.81205
▁nl	-9.81344
▁np	-9.81822
▁score	-9.83156
▁tt	-9.8316
▁lcm	-9.8324
[0],	-9.83289
/2	-9.83641
2++;	-9.8464
"")"	-9.85051
▁25	-9.85101
▁2);	-9.85126
));	-9.85201
▁{}	-9.85572
mn	-9.85805
▁sz	-9.8588
▁cek	-9.85913
OOOO	-9.86006
[0][	-9.86495
▁go	-9.87238
prime	-9.87779
check	-9.87889
▁'#'	-9.88221
7	-9.88936
▁'9')	-9.89002
▁'+'	-9.89103
▁1001	-9.89115
-------------+	-9.89214
true	-9.8957
mid	-9.89586
▁fast	-9.9069
top	-9.90765
▁'9'	-9.90981
▁50	-9.91053
▁'+')	-9.91121
▁yy	-9.91702
SEGMENT	-9.91718
pop	-9.91778
▁1000;	-9.91928
▁op	-9.92232
Second	-9.92323
▁'*')	-9.92415
▁kol	-9.92475
!	-9.92593
at	-9.92694
▁freq	-9.93002
[0][1]	-9.9301
▁10,	-9.93041
->	-9.9318
▁"".""	-9.9329
▁{0,	-9.9338
Friendship	-9.93472
▁found	-9.93616
▁bb	-9.93656
2.	-9.94111
▁fb	-9.9583
▁win	-9.95868
make	-9.96398
First	-9.96964
▁200	-9.97119
▁digit	-9.9726
▁--	-9.97509
!""	-9.97579
decrement	-9.9758
|)""	-9.97628
▁hi	-9.97751
TRIANGLE	-9.98133
▁multiply	-9.98139
▁high	-9.98175
▁#	-9.98242
▁mat	-9.9853
const	-9.98778
▁init	-9.99482
clear	-9.99987
▁cc	-10.0003
▁root	-10.007
2[0]	-10.0108
▁back	-10.0149
▁ex	-10.0152
3"	-10.0237
▁lo	-10.0286
▁8)	-10.0411
▁reverse	-10.0472
empty	-10.0501
▁'4'	-10.052
OOO	-10.0557
ok	-10.0582
]))	-10.0583
reverse	-10.063
▁5,	-10.0677
▁(((	-10.0682
▁coun	-10.0775
OO	-10.0784
▁multiple	-10.0818
iterator	-10.0827
ar	-10.088
▁""*"";	-10.0902
▁rest	-10.0929
▁bit	-10.0935
▁""-1	-10.0941
▁letter	-10.0977
val	-10.0992
MAXN	-10.1037
▁inp	-10.1091
▁(1)	-10.112
▁primes	-10.1149
▁tb	-10.115
▁lower	-10.1227
idx	-10.1229
left	-10.1231
illed	-10.1287
3;	-10.1329
[3];	-10.1344
▁EPS	-10.136
▁accept	-10.136
define	-10.1374
maxx	-10.1386
▁item	-10.1425
[100];	-10.1544
time	-10.1559
PRINT	-10.1579
LEFT	-10.1584
▁-1}	-10.1597
▁square	-10.1606
▁{1,	-10.163
▁further	-10.1643
>::	-10.1648
[2])	-10.1683
▁55	-10.1692
▁need	-10.1731
(2,	-10.1735
▁low	-10.1735
▁sol	-10.179
▁endline	-10.1792
▁10000	-10.1823
[1][0]	-10.1845
▁2))	-10.1859
▁order	-10.1862
▁6)	-10.1906
▁sy	-10.1949
▁judge	-10.2019
▁best	-10.2026
▁26;	-10.2033
▁vv	-10.2104
(0)	-10.2114
▁us	-10.2124
▁color	-10.2152
▁adj	-10.2185
▁tp	-10.2229
▁bitshift	-10.2233
IMPOSSIBLE	-10.2238
▁dif	-10.2256
▁W	-10.2272
.............|""	-10.2287
▁""#	-10.2293
▁48	-10.2294
▁div	-10.2341
▁dem	-10.2358
▁isprime	-10.2381
name	-10.2454
▁iterat	-10.2456
al	-10.2471
Y	-10.2475
▁pr	-10.2488
[8]	-10.255
input	-10.2565
▁""/""	-10.2622
▁Min	-10.2625
▁11	-10.2668
▁book	-10.2788
[1005];	-10.2826
▁eps	-10.287
▁'8'	-10.2916
▁ck	-10.2919
element	-10.2923
[1][1]	-10.2956
1"	-10.2962
change	-10.2969
8	-10.2976
▁id	-10.2979
▁isPrime	-10.3118
[105],	-10.3129
▁valid	-10.3175
[101];	-10.3227
▁31	-10.3262
Time	-10.3265
▁1}	-10.3282
▁upper	-10.3291
DOWN	-10.3302
UP	-10.3304
[1],	-10.333
▁minx	-10.3345
[100005];	-10.3381
row	-10.3449
▁resp	-10.3476
▁cal	-10.348
[1][	-10.3498
▁chars	-10.3536
▁grid	-10.354
▁'#';	-10.357
▁'('	-10.3618
]]++;	-10.3624
[10];	-10.3626
▁'.')	-10.3639
][2]	-10.3661
▁tc	-10.3672
#.#.#.#.#.#.	-10.3698
▁which	-10.3705
▁dimension	-10.3706
▁myset	-10.3715
18	-10.3715
▁store	-10.3716
▁queue	-10.3738
▁4,	-10.3771
▁iterator	-10.3781
▁point	-10.3793
▁con	-10.3868
▁WINS	-10.3883
▁Arr	-10.3894
▁0}	-10.3915
▁1000000	-10.3945
▁br	-10.3947
▁joy	-10.4
▁100001	-10.4002
swap	-10.4006
▁table	-10.4032
[1];	-10.4062
9;	-10.4063
[4];	-10.4078
[1000];	-10.4087
MIN	-10.4099
▁shift	-10.4157
▁fill	-10.417
▁gap	-10.4172
▁360	-10.4179
add	-10.4193
▁ada	-10.4196
▁9;	-10.4199
▁points	-10.4216
▁hh	-10.4217
[2];	-10.4221
▁skip	-10.4248
2[1]	-10.4256
▁show	-10.4281
▁chest	-10.4289
▁display	-10.4289
[7]	-10.4298
▁remainder	-10.4313
▁fabs	-10.4354
cmp	-10.4407
▁begin	-10.4418
▁sign	-10.4441
▁fin	-10.4461
▁visited	-10.4464
.#.#.#.#.	-10.4513
[2][1]	-10.4519
▁looping	-10.4534
▁Number	-10.4541
▁minus	-10.4546
▁used	-10.4551
▁rows	-10.4576
▁clear	-10.462
▁type	-10.4639
▁re	-10.4657
no	-10.4699
[110];	-10.473
▁nums	-10.4743
diff	-10.4779
last	-10.4779
▁fixed	-10.4838
front	-10.4865
ter	-10.4865
unsigned	-10.4866
▁I	-10.4871
▁suma	-10.4916
▁magic	-10.4922
ll	-10.4933
result	-10.4966
▁1][0]	-10.4973
ret	-10.498
▁sb	-10.4982
[1][2]	-10.5037
ER	-10.5095
▁stack	-10.5126
▁1000000000	-10.5152
Correct	-10.5167
▁blue	-10.5172
.#.#.#.#.#.	-10.5203
▁level	-10.5207
▁stdout	-10.5225
▁OR	-10.5225
▁stream	-10.5243
ss	-10.5253
▁250)	-10.5257
txt	-10.5273
out	-10.5278
mod	-10.5293
▁move	-10.5306
▁fuel	-10.5332
▁father	-10.5338
▁visit	-10.535
RU	-10.5356
Akshat	-10.5367
1);	-10.5368
▁items	-10.5384
▁asc	-10.5422
▁days	-10.5426
▁1010	-10.543
number	-10.5447
▁biceps	-10.5474
red	-10.5491
▁20;	-10.5492
▁'?'	-10.5532
▁good	-10.5549
▁pass	-10.555
▁'*';	-10.5574
▁fl	-10.5587
assign	-10.5588
▁sub	-10.5617
=2	-10.5648
▁fact	-10.5656
▁erase	-10.5661
▁exp	-10.568
▁12;	-10.5681
]=	-10.5708
▁statement	-10.5713
cost	-10.5732
ind	-10.5737
▁dir	-10.5742
▁mult	-10.5777
Malvika	-10.5796
▁'(')	-10.5801
total	-10.5804
▁mas	-10.585
▁97	-10.5873
[0][2]	-10.5888
▁100)	-10.5897
::	-10.5901
▁key	-10.5989
▁ty	-10.5997
▁'\0'	-10.6063
-1)	-10.6063
LU	-10.6067
▁""0	-10.6069
▁'#')	-10.608
▁gets	-10.6082
▁match	-10.6087
▁fathercnt	-10.609
LD	-10.61
▁puts	-10.6102
▁1][1]	-10.6103
▁brr	-10.6103
RD	-10.611
[2][0]	-10.6117
▁No	-10.6136
4,	-10.6136
sqrt	-10.6137
▁file	-10.6164
▁su	-10.6165
▁9)	-10.6192
▁through	-10.6193
▁"""";	-10.6227
▁red	-10.6227
▁se	-10.6231
]--;	-10.6247
|)	-10.6268
asya	-10.6275
▁ff	-10.6286
▁tem	-10.6309
▁unique	-10.6332
▁kk	-10.6335
▁'.';	-10.6352
▁moves	-10.6359
TEAM	-10.6364
▁Yes	-10.6383
▁arg	-10.6409
▁hate	-10.6423
▁hash	-10.645
ending	-10.6482
rat	-10.6483
dfs	-10.6484
▁ele	-10.6554
or	-10.6579
▁ctr	-10.6591
2);	-10.6593
man	-10.6618
▁setting	-10.6622
▁until	-10.6657
(-1.0)	-10.6658
▁hitung	-10.6659
▁three	-10.6661
-9	-10.6662
▁lol	-10.669
▁'8')	-10.6696
▁after	-10.6775
▁mul	-10.6782
▁distance	-10.679
[++	-10.6798
mark	-10.6801
blue	-10.6839
[100],	-10.6884
▁keyboard	-10.6895
▁nothing	-10.6895
▁precision	-10.6933
RE	-10.6949
run	-10.6961
vec	-10.6966
▁3"	-10.6974
IM	-10.7017
[3])	-10.7025
▁has	-10.7027
▁TESTS	-10.7033
AT	-10.7035
▁var	-10.7073
▁fun	-10.708
▁WI	-10.7089
▁address	-10.7141
keep	-10.7141
▁200005	-10.7143
▁F	-10.717
pow	-10.7178
▁inv	-10.7201
right	-10.7204
▁MIN	-10.7215
aren	-10.727
▁calc	-10.7289
▁ll	-10.7302
▁en	-10.7326
output	-10.7332
display	-10.7336
▁comp	-10.7351
0;	-10.7377
▁reference	-10.7393
▁content	-10.7394
[100005]	-10.7411
▁'1';	-10.7431
▁64	-10.7441
Power	-10.7448
child	-10.7462
Mahmoud	-10.7462
woman	-10.7462
Ehab	-10.7462
▁list	-10.7484
▁""?""	-10.7507
▁float	-10.7512
oward	-10.752
▁vectors	-10.7522
[2][2]	-10.7524
[10]	-10.753
▁dep	-10.754
▁'\0';	-10.7542
▁compare	-10.7553
Reality	-10.7585
Space	-10.7585
Soul	-10.7585
Mind	-10.7588
head	-10.7593
chest	-10.7594
▁998244353	-10.763
▁sieve	-10.7645
come	-10.7656
▁board	-10.7665
▁100010	-10.7667
▁edges	-10.7683
▁'7'	-10.7686
fa	-10.7708
▁half	-10.7766
▁Friendship	-10.7781
▁guy	-10.7782
▁'['	-10.7792
▁tolower	-10.7825
▁numbers	-10.7832
▁green	-10.7835
▁ed	-10.7881
▁priority	-10.7919
1--;	-10.7929
E	-10.7966
▁qr	-10.7971
.............|	-10.8004
▁(!(	-10.8019
▁ant	-10.8034
[110]	-10.8043
▁':'	-10.8086
up	-10.8103
op	-10.8112
▁cou	-10.8127
▁'4')	-10.8129
▁year	-10.8155
▁round	-10.8188
▁""#.""	-10.8191
""}	-10.82
▁(180	-10.8205
▁pref	-10.821
▁U	-10.8226
▁med	-10.8242
▁counting	-10.8257
green	-10.827
[5];	-10.8271
▁'7')	-10.8294
[101],	-10.8326
▁putchar	-10.8328
▁prog	-10.8336
▁oo	-10.8374
biceps	-10.8411
[1000],	-10.8446
▁lim	-10.8485
▁1.0	-10.8507
▁ta	-10.8545
exclusive	-10.8554
']++;	-10.8581
▁infinite	-10.861
[1001]	-10.8616
▁2005	-10.8621
▁columns	-10.8621
ara	-10.8644
▁1000000009	-10.8657
xx	-10.87
▁ql	-10.8733
▁""#"";	-10.8757
▁starty	-10.8759
▁15)	-10.8763
▁spf	-10.8777
[9]	-10.8785
▁32	-10.8785
[26]	-10.8804
color	-10.881
Black	-10.8814
White	-10.8814
[1005]	-10.8817
[3],	-10.8835
2))	-10.8845
erminate	-10.8858
minn	-10.8865
Color	-10.8902
▁goal	-10.8904
▁matches	-10.8907
▁booleans	-10.8935
▁'<'	-10.8958
Chris	-10.8994
Mishka	-10.8994
queue	-10.8995
▁month	-10.9027
▁Input	-10.9052
▁curlower	-10.9053
▁does	-10.9056
▁calling	-10.9106
resize	-10.9144
show	-10.9147
▁':')	-10.9162
▁love	-10.9204
▁rlmoves	-10.9205
▁""."";	-10.9208
▁winner	-10.922
▁cot	-10.924
▁psum	-10.925
▁180	-10.925
-1,	-10.9254
Penny	-10.9296
Danik	-10.9299
Anton	-10.9299
orange	-10.9299
▁rat	-10.9305
▁game	-10.933
▁man	-10.9333
▁Set	-10.9366
▁""2""	-10.9367
[2],	-10.9388
win	-10.9426
▁itr	-10.9428
Leonard	-10.9452
Rajesh	-10.9452
Sheldon	-10.9452
▁case	-10.9478
and	-10.9493
▁exist	-10.9495
▁sumb	-10.9508
▁GCD	-10.9513
▁extra	-10.9518
▁side	-10.9528
▁flg	-10.9529
▁MX	-10.9531
▁mymap	-10.9541
[100000]	-10.9555
▁60;	-10.9571
▁pp	-10.9577
▁memset	-10.9581
▁front	-10.9603
aux	-10.9618
#.#.#.#.#.|	-10.9633
(-1);	-10.9651
▁500	-10.9663
▁(0);	-10.9666
of	-10.9667
▁Count	-10.9685
▁turn	-10.9693
▁cap	-10.9697
▁log	-10.9717
▁yes	-10.9727
(3	-10.9728
▁doubles	-10.9752
us	-10.9756
▁maxm	-10.9762
:	-10.9771
Incorrect	-10.9775
#.#.#.#.#.|.|)""	-10.9775
maxi	-10.9784
2=	-10.9792
cw	-10.9792
curr	-10.9802
tot	-10.9819
▁goto	-10.9835
▁big	-10.9855
pre	-10.9884
▁men	-10.9907
▁tm	-10.9937
Misha	-10.9939
yellow	-10.9939
▁txt	-10.994
▁28	-10.995
[1001];	-10.9977
▁16	-10.9996
▁Ans	-11.0037
▁rl	-11.0056
-1][	-11.0101
purple	-11.0104
Tie	-11.0107
tc	-11.0107
▁contain	-11.013
▁write	-11.013
▁18	-11.0185
▁cond	-11.019
▁mov	-11.0235
value	-11.026
position	-11.0277
▁cy	-11.0316
2[1])	-11.0322
mini	-11.0332
▁1]))	-11.0351
▁rec	-11.0352
▁2*	-11.036
erate	-11.0399
prev	-11.0412
▁iter	-11.0449
ma	-11.0475
▁rr	-11.0496
▁shu	-11.051
NG	-11.0522
▁lessons	-11.0524
▁alpha	-11.0532
▁tam	-11.0547
▁120	-11.0628
ccw	-11.0636
▁2])	-11.0643
▁gr	-11.0663
▁way	-11.067
▁same	-11.0672
▁md	-11.0682
▁nCr	-11.0687
▁cycle	-11.0687
▁(360	-11.0709
precision	-11.0753
Dodecahedron	-11.0778
Tetrahedron	-11.0778
Octahedron	-11.0779
Cube	-11.0779
captain	-11.0803
▁counts	-11.0839
▁weak	-11.0859
▁diag	-11.0875
▁20)	-11.0878
');	-11.0879
▁status	-11.0879
▁coins	-11.0882
▁fix	-11.0917
▁tab	-11.0918
▁dat	-11.0919
▁cup	-11.0932
▁open	-11.0934
▁asd	-11.0935
('	-11.0945
▁le	-11.0951
▁par	-11.0971
▁),	-11.1013
▁11;	-11.1017
step	-11.1035
▁menor	-11.1044
▁stringstream	-11.1055
oke	-11.1077
▁!(	-11.1083
.""	-11.1135
▁letters	-11.1144
▁startx	-11.1181
▁lenb	-11.1182
▁sup	-11.1211
▁edge	-11.1219
▁proceed	-11.1226
▁""5""	-11.1251
▁pop	-11.1274
▁998244353;	-11.1306
float	-11.1339
▁200000	-11.1342
▁toupper	-11.1349
false	-11.1359
base	-11.136
[105]	-11.1372
[0]);	-11.1373
▁contador	-11.1418
▁tim	-11.142
▁cell	-11.1425
▁dig	-11.1432
▁240	-11.1433
▁'0');	-11.1451
fabs	-11.1477
OT	-11.1505
18;	-11.1517
▁bl	-11.1524
cast	-11.1552
append	-11.1555
▁place	-11.1571
▁Solve	-11.1607
▁32;	-11.1617
mber	-11.1617
▁graph	-11.1622
RA	-11.1668
▁'>'	-11.1712
▁')')	-11.1715
▁sq	-11.1716
-2]	-11.1721
▁1000005	-11.1761
▁lst	-11.1765
one	-11.1787
home	-11.1787
(10	-11.1791
▁stdin	-11.1803
▁86400	-11.1822
▁')'	-11.1858
▁args	-11.1862
log	-11.1868
▁1]);	-11.1876
▁""4""	-11.1892
][1])	-11.1924
counter	-11.1932
Equal	-11.1944
solve	-11.1948
#.#.#.#.#.|.|""	-11.1954
▁pw	-11.1955
la	-11.1984
▁modul	-11.2
▁was	-11.2017
▁sumr	-11.208
col	-11.2103
▁bits	-11.2105
Icosahedron	-11.2109
[3][3];	-11.2117
▁2}	-11.2124
signed	-11.216
▁First	-11.2201
▁uneven	-11.2207
▁reduce	-11.2208
▁matrix	-11.2208
▁rounded	-11.2212
▁seq	-11.223
▁rta	-11.2239
▁lucky	-11.2239
points	-11.2255
▁setprecision	-11.2265
[1010]	-11.2307
low	-11.2313
▁100000;	-11.2348
▁prices	-11.2349
till	-11.2358
▁final	-11.2371
rem	-11.2374
▁96	-11.2387
0)	-11.2388
▁""-""	-11.2415
zxcvbnm	-11.2416
sdfghjkl	-11.2416
▁numOps	-11.2418
strcpy	-11.242
_1	-11.242
=3	-11.2423
▁req	-11.2431
[200]	-11.2433
▁udmoves	-11.244
▁bfs	-11.2442
▁squared	-11.245
▁1000000007)	-11.2453
▁200001	-11.248
▁levels	-11.2488
2[0])	-11.2508
data	-11.2517
▁12)	-11.2531
▁100,	-11.2546
+1][	-11.2566
Masha	-11.2568
Dasha	-11.2568
team	-11.2572
freopen	-11.2572
found	-11.2573
[11]	-11.2605
▁250	-11.2607
▁large	-11.2624
lo	-11.2636
▁'?')	-11.2638
▁act	-11.2651
▁reset	-11.2654
▁del	-11.2657
▁votes	-11.2658
dif	-11.2669
10	-11.2673
▁dim	-11.2677
ceil	-11.2679
▁reg	-11.2685
▁tx	-11.2694
ly	-11.2706
▁30;	-11.2759
/10	-11.2765
▁{};	-11.2771
next	-11.279
▁51	-11.2792
▁light	-11.282
qwertyuiop	-11.2846
▁respectively	-11.2846
▁more	-11.2847
▁divisor	-11.285
▁state	-11.2857
▁vs	-11.2862
Max	-11.2867
▁rep	-11.2872
▁gl	-11.2883
To	-11.2889
▁players	-11.2897
▁5];	-11.2899
▁10);	-11.2904
▁sm	-11.2929
[105][105];	-11.2962
▁""+""	-11.2976
▁DOWN	-11.2995
▁UP	-11.2996
exp	-11.3
Alice	-11.301
inline	-11.3015
UR	-11.3029
[10],	-11.3047
▁ver	-11.306
▁star	-11.3062
asilisa	-11.3068
▁positive	-11.3069
▁least	-11.3069
▁Second	-11.3073
-""	-11.3083
act	-11.3084
▁48;	-11.311
▁lca	-11.3112
▁home	-11.3137
[101][101];	-11.3157
▁maxy	-11.3159
[100001];	-11.3192
▁sh	-11.322
▁501	-11.323
TIE	-11.3236
Bob	-11.3237
whichPosn	-11.3239
root	-11.324
visited	-11.3243
reg	-11.3263
et	-11.3276
▁increas	-11.328
anako	-11.3283
▁multiplie	-11.3295
optimization	-11.3295
▁Rozdil	-11.3295
▁limit	-11.3298
▁clock	-11.3303
▁save	-11.3312
▁pot	-11.3314
▁poly	-11.3326
▁27	-11.3329
<=	-11.3348
▁pl	-11.335
[100000];	-11.3352
▁fy	-11.3377
▁head	-11.3396
▁fx	-11.3439
-2	-11.344
[0]++;	-11.3452
▁2000	-11.3456
▁10]	-11.3457
compare	-11.3472
kol	-11.3473
▁work	-11.3493
▁weight	-11.35
▁put	-11.3502
▁steps	-11.3519
▁solution	-11.3529
▁toggle	-11.3531
▁oven	-11.3539
▁speed	-11.3545
▁MN	-11.3573
>0	-11.3578
][1];	-11.3589
co	-11.3602
]])	-11.3611
[100001]	-11.363
▁lena	-11.363
dest	-11.3639
▁35	-11.3662
word	-11.3675
ta	-11.3687
subtractions	-11.3687
contest	-11.3707
[200];	-11.3731
▁factor	-11.3739
ary	-11.3739
bound	-11.3766
Slava	-11.3766
▁falsy	-11.3766
▁whichPosn	-11.3826
+1)	-11.3837
▁captain	-11.3842
▁10000000	-11.3846
▁sc	-11.385
▁ones	-11.3855
▁220	-11.3913
_0	-11.3916
▁clo	-11.3949
undefined	-11.395
▁tar	-11.3956
that	-11.3959
dx	-11.3965
▁65	-11.3965
alue	-11.3979
[10000]	-11.3979
esp	-11.398
not	-11.3988
▁buf	-11.4006
▁""1/2""	-11.4028
▁money	-11.4042
mm	-11.4075
▁xay	-11.4088
9,	-11.4126
▁13)	-11.4149
1][	-11.4152
[100]	-11.4173
day	-11.4179
Danil	-11.4187
Nikita	-11.4187
Olya	-11.4187
Ann	-11.4192
unique	-11.4204
▁1].	-11.4216
▁nex	-11.4226
▁dg	-11.4229
rest	-11.4233
DL	-11.4242
▁decreasing	-11.426
▁CUR	-11.4262
ARD	-11.4267
▁Pic	-11.4269
▁remaining	-11.427
▁participants	-11.4271
▁chess	-11.4277
▁jum	-11.4287
(-1)	-11.4305
)((	-11.4329
dg	-11.4351
[100010]	-11.4355
>())	-11.4362
-8	-11.4399
dist	-11.4435
Ciel	-11.4453
ULDR	-11.4456
▁area	-11.4481
ct	-11.4482
▁qq	-11.4489
▁every	-11.4516
▁nonzero	-11.4516
▁width	-11.4516
▁LCM	-11.4517
▁chang	-11.4522
▁201	-11.4524
▁""5/6""	-11.4536
▁""1/3""	-11.4537
▁""2/3""	-11.4537
▁team	-11.4548
▁exe	-11.457
]]]	-11.4619
▁cp	-11.4656
▁answ	-11.4656
+2]	-11.4665
▁dos	-11.4676
[101]	-11.4681
▁cop	-11.472
ignore	-11.472
UL	-11.473
▁names	-11.4732
%	-11.4739
1.0	-11.4743
▁rotate	-11.4745
nt	-11.475
▁words	-11.4765
(1);	-11.4775
▁mode	-11.478
▁bottles	-11.4785
▁bills	-11.4798
▁102	-11.4801
▁salt	-11.4804
▁fff	-11.4823
ome	-11.4853
▁gg	-11.4862
▁5001	-11.4868
▁answers	-11.4874
▁123	-11.4884
[30]	-11.491
▁dr	-11.4929
▁'[')	-11.4931
▁miny	-11.4931
▁its	-11.4936
▁cntr	-11.4951
▁10005	-11.4956
▁sumz	-11.4957
[3][3]	-11.4962
isdigit	-11.4993
upper	-11.4995
need	-11.4996
▁dd	-11.4999
hash	-11.5009
▁amount	-11.5018
*(	-11.505
▁Need	-11.5051
▁largest	-11.5052
▁execute	-11.5052
▁loss	-11.5052
▁hasil	-11.5057
▁matriz	-11.5063
▁bob	-11.5065
▁summ	-11.5093
[30];	-11.51
▁contains	-11.5107
inp	-11.5113
[200005];	-11.5198
score	-11.5207
tt	-11.5212
▁zz	-11.5233
owel	-11.5251
[0].	-11.5264
2--;	-11.5266
[10000];	-11.5294
+2	-11.5318
▁16)	-11.532
▁factorial	-11.5328
▁bottom	-11.5328
.#.#.#.#.#.#.|.|	-11.533
DR	-11.5344
1))	-11.5359
▁1000000;	-11.5366
>=	-11.5378
▁done	-11.5383
▁48)	-11.5387
▁""|#.	-11.542
>(	-11.5422
to	-11.5437
▁36	-11.5439
▁pro	-11.5459
▁el	-11.5461
par	-11.5462
▁(7	-11.5511
▁sp	-11.5519
▁29	-11.5521
▁""|""	-11.5528
reate	-11.5534
,./""	-11.5545
2-	-11.5552
isprime	-11.5561
▁2001	-11.5588
▁command	-11.5597
▁stone	-11.56
▁hav	-11.5605
▁other	-11.5613
▁Output	-11.5613
▁lowercase	-11.5613
▁method	-11.5613
▁que	-11.5618
▁Cnt	-11.5619
▁static	-11.5619
▁password	-11.5621
▁ope	-11.5627
▁record	-11.5627
▁deg	-11.5628
▁vest	-11.563
▁present	-11.5632
▁Sum	-11.5636
▁cards	-11.5641
▁ats	-11.5658
▁old	-11.5663
▁he	-11.5671
]-	-11.5706
............|""	-11.5711
▁92	-11.5714
digit	-11.5718
▁Chris	-11.5724
▁Mishka	-11.5724
[1000]	-11.5731
▁xmax	-11.5737
▁105;	-11.5741
▁endy	-11.5746
line	-11.5762
▁An	-11.577
▁999999	-11.5782
▁'/'	-11.5798
▁indx	-11.581
div	-11.5817
▁tri	-11.5818
cek	-11.5854
[5][5];	-11.5855
open	-11.5868
▁code	-11.587
▁part	-11.5877
▁jump	-11.5882
increase	-11.5883
▁OO	-11.5885
the	-11.5888
▁decimal	-11.5897
▁player	-11.59
▁distanc	-11.5901
Bear	-11.5907
Elephant	-11.5907
▁jumlah	-11.5907
▁maps	-11.5909
▁qtb	-11.591
▁previous	-11.5912
▁interval	-11.5917
▁mishka	-11.5918
▁10000;	-11.5929
▁short	-11.5942
▁loc	-11.5944
▁200010	-11.5969
▁cad	-11.5991
on	-11.6019
▁inch	-11.6029
oo	-11.6056
▁9,	-11.6074
▁sw	-11.6106
ign	-11.6112
▁pairs	-11.612
[60]	-11.612
absolute	-11.6155
fffffff	-11.6176
▁mxv	-11.6176
▁sumc	-11.6204
aeiou	-11.621
▁label	-11.621
▁""***""	-11.6211
▁DFS	-11.6211
▁convert	-11.6213
▁leaf	-11.6215
▁des	-11.6217
▁parent	-11.6222
▁crew	-11.6224
▁tree	-11.6225
new	-11.6234
▁cmd	-11.6243
▁13	-11.6257
[6];	-11.6275
▁122	-11.6276
sz	-11.6316
[1].	-11.6339
[55];	-11.6375
▁""<""	-11.6386
▁"">""	-11.6394
list	-11.6405
▁ep	-11.6411
▁1));	-11.6415
▁11)	-11.6419
▁1000000009;	-11.6424
▁22)	-11.6427
▁24	-11.6442
letter	-11.6447
▁qua	-11.6454
▁mmax	-11.6456
impossible	-11.6457
EASY	-11.6462
stream	-11.6491
▁floor	-11.6498
▁endx	-11.65
▁program	-11.6523
▁fastIo	-11.6523
oyomi	-11.6523
▁getInt	-11.6523
▁inches	-11.6526
▁Blue	-11.6533
▁memo	-11.6536
▁ysum	-11.6537
▁carry	-11.6539
()))	-11.6542
▁poww	-11.6548
▁5000	-11.6553
▁maxN	-11.6559
4;	-11.6574
(10)	-11.6592
0"	-11.6618
▁wp	-11.6627
1+	-11.6634
▁dot	-11.6644
▁60)	-11.6646
▁cha	-11.6687
▁48);	-11.6693
▁(4	-11.6702
test	-11.6736
▁bigge	-11.6753
-7	-11.678
gap	-11.679
▁resta	-11.679
best	-11.6797
lol	-11.6801
ash	-11.6817
▁rot	-11.6824
▁hang	-11.6842
▁spec	-11.6843
▁given	-11.6845
▁'|'	-11.6847
▁pole	-11.6854
▁plen	-11.6858
▁active	-11.6861
▁box	-11.6869
▁have	-11.687
▁buff	-11.6883
▁soroban	-11.6884
2[""	-11.6891
▁depth	-11.6899
▁'5')	-11.6935
▁""1/1""	-11.6936
▁pv	-11.6938
[1000000];	-11.6942
▁take	-11.6949
▁imax	-11.6964
▁alt	-11.6973
[12]	-11.6985
vowel	-11.6988
square	-11.6988
▁maxs	-11.7
ve	-11.701
halfplus	-11.7109
card	-11.7125
freq	-11.7126
yes	-11.7137
▁divis	-11.7149
▁300	-11.7151
▁1]++;	-11.7166
ios	-11.7171
Alien	-11.7179
hello	-11.7179
permutation	-11.7179
▁invert	-11.7179
▁chris	-11.7182
▁banyak	-11.7182
▁coord	-11.7182
▁person	-11.7182
▁raw	-11.7184
▁bisa	-11.7189
ULL	-11.719
▁posy	-11.7194
▁loct	-11.7199
▁frest	-11.7208
▁cakes	-11.7209
9)	-11.7229
▁15;	-11.7231
4"	-11.7237
▁stones	-11.7239
▁vet	-11.7247
▁3])	-11.7248
inf	-11.7261
▁games	-11.7261
pri	-11.7282
▁sumy	-11.7313
yy	-11.7319
▁beat	-11.7335
1[""	-11.7358
[1000005];	-11.7365
tp	-11.737
level	-11.7404
[20];	-11.7406
ust	-11.7452
ajout	-11.7465
half	-11.7468
▁lsum	-11.7471
▁acum	-11.7504
▁sumA	-11.7515
▁infinitely	-11.7524
]=1	-11.7531
▁palindrome	-11.7544
setf	-11.7545
▁black	-11.7551
▁lef	-11.7551
▁qpow	-11.7555
▁E	-11.7572
▁22;	-11.7575
▁den	-11.7592
ith	-11.7602
[51]	-11.7623
re	-11.763
▁bak	-11.7645
▁tstep	-11.7654
▁400	-11.7654
▁ymin	-11.7659
▁sir	-11.7719
▁func	-11.7722
▁ee	-11.773
▁pri	-11.7774
npos	-11.7774
▁'}'	-11.7778
▁100001;	-11.7782
▁getline	-11.7793
Impossible	-11.7821
colom	-11.7822
lucky	-11.7824
depth	-11.7825
visit	-11.7831
layer	-11.784
▁prealoc	-11.7881
▁tabla	-11.7881
▁bigmod	-11.7881
▁ANS	-11.7884
▁numOf	-11.7884
▁lzl	-11.7884
▁choose	-11.7886
▁difference	-11.7886
▁biao	-11.7888
▁contiguous	-11.789
▁computer	-11.7896
▁most	-11.7897
▁hotels	-11.7898
*2	-11.7901
[5][5]	-11.7901
1-	-11.7901
pp	-11.7902
▁liter	-11.7902
▁','	-11.7904
▁gesture	-11.7905
▁sec	-11.7908
▁card	-11.7909
((3	-11.7916
▁siz	-11.7922
▁bao	-11.7929
▁prf	-11.7935
▁mask	-11.7945
▁150	-11.7959
▁lie	-11.7975
[55][55];	-11.8018
▁bal	-11.8034
▁getint	-11.8041
[1010];	-11.8062
▁20000	-11.8097
gets	-11.8117
sub	-11.8151
[50]	-11.8154
cont	-11.8156
▁'5'	-11.8157
dir	-11.8164
mat	-11.8176
mxm	-11.8177
▁LEFT	-11.8184
dep	-11.8196
▁err	-11.8198
[2005];	-11.8204
#.#.#.#.|	-11.8209
zhuangtai	-11.8251
▁condition	-11.8252
▁danik	-11.8252
▁slogan	-11.8252
▁nor	-11.8254
▁location	-11.8254
▁biaoji	-11.8262
▁finall	-11.8268
▁misha	-11.8269
cc	-11.8275
▁kanan	-11.8276
▁node	-11.8283
▁search	-11.8285
▁qta	-11.829
▁tmo	-11.8291
▁marks	-11.8321
▁wt	-11.8326
[100000	-11.8383
][3]	-11.8413
▁pe	-11.8418
▁TEAM	-11.8442
[100][100];	-11.8446
en	-11.8447
[{	-11.8447
post	-11.8453
▁dest	-11.8461
▁Correct	-11.8468
▁""3""	-11.8471
▁205	-11.8471
▁acc	-11.8472
+1,	-11.8475
ac	-11.8495
▁bus	-11.8509
▁Time	-11.8518
▁pd	-11.8523
▁'!'	-11.8532
▁ccw	-11.8542
edge	-11.8545
][2];	-11.8548
▁th	-11.8554
▁suff	-11.8566
▁tu	-11.8569
6;	-11.8571
turn	-11.8575
fixed	-11.858
judge	-11.858
mymap	-11.8581
used	-11.8591
moves	-11.8594
▁""7""	-11.8594
▁es	-11.8609
strlen	-11.8623
▁sumB	-11.8636
3372036854775807	-11.8636
▁2147483647	-11.8636
▁voters	-11.8636
▁query	-11.8636
▁tr	-11.8636
9+7	-11.8636
▁po	-11.8637
▁deq	-11.864
▁workTime	-11.8642
▁Map	-11.8645
▁towels	-11.8646
▁soldier	-11.8648
▁height	-11.8651
▁cpy	-11.8663
▁cel	-11.8668
▁1.0)	-11.8685
▁200;	-11.8692
[50];	-11.8738
▁600	-11.8739
▁orange	-11.8748
▁ways	-11.8752
▁dc	-11.8755
▁To	-11.8757
▁lc	-11.877
[26];	-11.8774
[1000	-11.878
▁3*	-11.881
.|	-11.8815
▁ymax	-11.882
-6	-11.8845
▁128	-11.8859
ex	-11.8862
<0	-11.8873
▁maxlen	-11.8884
[10][10];	-11.8893
▁newsum	-11.8895
▁1005;	-11.8901
price	-11.8901
rbegin	-11.8913
olume	-11.893
▁3.14159	-11.8934
▁non	-11.8935
dy	-11.8947
[100010];	-11.8947
▁send	-11.8959
▁maxa	-11.8986
sign	-11.8997
▁ev	-11.901
▁ihash	-11.9016
LO	-11.9022
▁negative	-11.9036
▁""25""	-11.9036
▁Mod	-11.9036
▁decrypt	-11.9037
▁quotient	-11.9037
▁smaller	-11.9037
▁powmod	-11.904
▁people	-11.9042
▁linha	-11.9042
▁palin	-11.9043
▁four	-11.9044
▁31}	-11.9048
▁grest	-11.905
▁pod	-11.9052
▁larger	-11.9057
▁Cmp	-11.9062
marks	-11.9083
▁""1/6""	-11.9105
▁vowel	-11.9107
▁tims	-11.9111
▁kkk	-11.9126
▁1][2]	-11.9132
adj	-11.9136
▁dsa	-11.9136
=-1	-11.9147
err	-11.9159
▁xmin	-11.9167
▁prep	-11.9168
▁prevc	-11.9178
▁Anton	-11.9189
▁ios	-11.919
▁123;	-11.923
.#.#.#.#.#.#.#.|	-11.9232
▁'-';	-11.9245
▁isdigit	-11.9258
▁10];	-11.9261
[55]	-11.9262
▁numb	-11.9274
▁1001;	-11.9316
▁'<')	-11.9321
/5	-11.9339
iterat	-11.9358
5;	-11.9364
ped	-11.9366
▁mmin	-11.9377
▁(0)	-11.9379
poly	-11.9396
isPrime	-11.9397
current	-11.9397
ector	-11.9422
tstep	-11.9423
▁maxl	-11.9442
▁page	-11.9443
joy	-11.9446
numberOfElements	-11.9452
▁jumlahgenap	-11.9452
▁pause	-11.9452
▁geek	-11.9455
▁Alex	-11.9461
▁1},	-11.9462
eros	-11.9463
▁1000001	-11.9463
▁modexp	-11.9469
▁timr	-11.9471
▁ctx	-11.9471
▁pwr	-11.9475
▁90	-11.9481
▁per	-11.9483
[4])	-11.9499
[1]++;	-11.9501
▁seen	-11.9505
dot	-11.9518
▁ref	-11.9519
▁angle	-11.9522
[102];	-11.9527
▁doit	-11.9558
▁pairt	-11.9564
[60];	-11.958
▁mo	-11.959
tr	-11.9611
▁9999999	-11.9613
▁Danik	-11.9613
▁5005	-11.9635
▁LL	-11.9644
▁Ehab	-11.9646
▁Mahmoud	-11.9646
▁woman	-11.9646
▁divs	-11.9652
▁tdiff	-11.9652
)*	-11.9666
primes	-11.9672
▁25)	-11.968
[10005];	-11.9706
▁nadj	-11.9707
valid	-11.9724
▁47	-11.9729
▁26)	-11.9772
▁sss	-11.9808
()])	-11.9821
▁(10	-11.9823
cup	-11.9826
money	-11.9831
exist	-11.9831
TESTS	-11.9831
▁yf	-11.9832
▁'2'	-11.984
▁(*	-11.9844
▁counta	-11.9853
(0	-11.9859
▁column	-11.987
▁xor	-11.9872
▁hor	-11.9883
▁prohibited	-11.9887
▁wait	-11.9888
[27]	-11.989
▁tempm	-11.989
▁army	-11.9896
▁binary	-11.9897
▁text	-11.99
▁palabra	-11.9904
▁fail	-11.9908
▁discounts	-11.991
▁foo	-11.9912
▁atoi	-11.9915
vv	-11.9919
▁10010	-11.9922
▁cols	-11.9923
▁fir	-11.9925
]+	-11.9926
▁ten	-11.9927
▁isgro	-11.9927
▁maxv	-11.9932
+1]-	-11.9951
▁def	-11.9955
[15]	-11.9969
oy	-11.9973
▁(-1)	-12.0004
▁vasya	-12.0016
▁kq	-12.0021
▁yellow	-12.0045
▁cant	-12.006
▁maxcnt	-12.0071
▁minP	-12.0085
#.#.#.#.#.|.|)	-12.0143
▁60,	-12.0146
[2][	-12.016
▁hb	-12.0162
-|""	-12.0165
▁""=""	-12.0167
▁97)	-12.0168
▁2];	-12.0174
counts	-12.0223
100,	-12.0238
dem	-12.0247
father	-12.0269
▁inter	-12.0271
▁posx	-12.0278
store	-12.0286
INT	-12.0286
minimum	-12.0287
big	-12.0293
▁alph	-12.0303
bak	-12.0304
getchar	-12.0311
ver	-12.0317
med	-12.0323
▁drink	-12.0326
▁small	-12.0336
▁desk	-12.0339
transform	-12.0342
▁jarak	-12.0342
stripe	-12.0342
+1)/2	-12.0343
▁nearest	-12.0343
▁comparator	-12.0343
▁End	-12.0345
▁smL	-12.0348
▁satu	-12.0348
▁enemy	-12.0351
▁dua	-12.0352
▁smR	-12.0352
▁numedges	-12.0353
▁sisa	-12.0356
▁505	-12.0356
▁anton	-12.0357
[11];	-12.0358
[1000][1000]	-12.0358
▁criba	-12.0364
▁OUTPUT	-12.0367
▁maxSize	-12.0369
▁possible	-12.0373
▁primos	-12.0373
▁ud	-12.0374
▁numver	-12.0374
▁rad	-12.0384
▁(26	-12.0388
▁nuts	-12.0397
▁If	-12.0408
▁opt	-12.0464
▁Incorrect	-12.0509
▁may	-12.0576
▁cw	-12.0585
▁0.5	-12.0587
("""")	-12.059
▁7-	-12.0593
▁1000010	-12.0595
wt	-12.0618
[1][2])	-12.0621
▁lat	-12.0622
▁digits	-12.0642
ult	-12.0649
nums	-12.0654
Found	-12.0657
Au	-12.0667
fb	-12.0668
iter	-12.067
players	-12.0686
▁LO	-12.0696
(1)	-12.0708
answer	-12.0717
Min	-12.0733
days	-12.0751
soroban	-12.0761
short	-12.0761
udmoves	-12.0762
86400	-12.0762
high	-12.0762
type	-12.0762
from	-12.0764
match	-12.0765
▁minm	-12.0767
]-'0'	-12.0778
'))	-12.0804
|""	-12.0804
[1000006]	-12.0808
es	-12.0811
'])	-12.0814
▁shengyu	-12.0818
▁Next	-12.0822
[0]--;	-12.0824
showpoint	-12.0824
()));	-12.0826
fingers	-12.0827
▁oil	-12.0827
▁smallest	-12.0828
▁occ	-12.0829
▁tag	-12.0833
▁only	-12.0834
{	-12.0845
hh	-12.0845
▁INFF	-12.0845
▁INPUT	-12.0847
▁qmarks	-12.0852
▁lens	-12.0866
▁21)	-12.087
ant	-12.0873
mas	-12.089
▁pointers	-12.0897
▁abc	-12.0921
Arr	-12.0929
][0];	-12.0937
▁100100	-12.0938
▁Minb	-12.0941
▁180)	-12.0946
▁freopen	-12.0954
▁nxt	-12.0957
▁Misha	-12.0991
[110][110];	-12.1004
][0])	-12.101
all	-12.1071
ong	-12.1073
cr	-12.1082
odd	-12.1088
▁nowp	-12.1116
'}	-12.1131
[200000	-12.1133
fl	-12.116
app	-12.1163
▁maxr	-12.1169
▁xxx	-12.1176
▁pb	-12.1177
#.#.#.#.#.|.|	-12.1178
zero	-12.1206
▁fg	-12.1247
Bulbasaur	-12.126
INF	-12.1261
board	-12.1262
lessons	-12.1262
status	-12.1262
grid	-12.1262
decrease	-12.1263
key	-12.1273
▁500;	-12.1289
pr	-12.1294
▁remain	-12.1307
▁999	-12.1314
▁process	-12.1318
▁fuck	-12.1318
▁inicial	-12.1318
▁jumlahganjil	-12.1318
▁qClose	-12.1318
▁third	-12.1318
▁uppercase	-12.1318
▁perColor	-12.1318
▁differ	-12.1319
▁LINF	-12.132
▁walk	-12.1323
▁buffer	-12.1323
▁numero	-12.1323
▁beginat	-12.1325
▁suck	-12.1325
▁tank	-12.1326
▁friends	-12.1329
▁deque	-12.1331
[5])	-12.1333
▁gc	-12.1333
▁**	-12.1338
▁sta	-12.1339
▁Way	-12.1341
▁sag	-12.1351
▁slot	-12.1355
▁chk	-12.1357
▁sheets	-12.1358
▁305	-12.1361
▁seg	-12.1363
00	-12.137
▁MAXT	-12.1372
)))	-12.138
▁inve	-12.1382
▁999999999	-12.1387
▁fpow	-12.1387
[1][1])	-12.1394
▁commands	-12.1396
▁suml	-12.141
▁17	-12.1412
▁cups	-12.1425
ck	-12.143
▁fac	-12.1443
▁ppow	-12.1443
▁'!')	-12.1455
[10010];	-12.1461
▁zsum	-12.1468
▁5);	-12.1498
▁pen	-12.1501
▁flagA	-12.1512
▁1][2])	-12.1538
▁31;	-12.1546
flog	-12.1547
▁fla	-12.1547
way	-12.1555
3[0]	-12.1555
[200005]	-12.1558
▁rc	-12.1564
▁ust	-12.1574
(8	-12.1605
▁122)	-12.1613
▁slen	-12.1624
[201]	-12.1625
▁nan	-12.1627
[120];	-12.1639
32	-12.1663
▁pas	-12.1675
[100	-12.1677
▁1000000000;	-12.1711
rend	-12.1734
over	-12.1738
▁14	-12.1747
▁97;	-12.1748
▁fans	-12.1764
▁(8	-12.1767
▁'3'	-12.1775
▁'6'	-12.178
isalpha	-12.1785
Number	-12.1786
fill	-12.1788
▁40	-12.1788
maximum	-12.1789
winner	-12.179
amt	-12.1797
(360	-12.1799
▁modd	-12.1812
▁gla	-12.1817
asd	-12.1822
▁follow	-12.1828
(""-1"")	-12.1844
▁error	-12.1845
▁degree	-12.1846
▁blyat	-12.1846
▁horizontal	-12.1846
▁boxes	-12.1846
▁capacity	-12.1849
▁nextPrime	-12.1849
▁denominator	-12.1849
cop	-12.1852
▁forward	-12.1856
▁pangkat	-12.1856
▁111	-12.1861
▁medals	-12.1864
▁bitset	-12.1872
)/	-12.1874
▁locg	-12.1877
▁conv	-12.1882
▁210	-12.1883
]));	-12.1886
▁coty	-12.1891
▁prefix	-12.1892
▁normal	-12.1893
▁101,	-12.1897
▁SEGMENT	-12.1898
▁hangx	-12.19
▁cut	-12.1903
▁nama	-12.1904
▁neo	-12.1905
▁Bulbasaur	-12.1905
oop	-12.1912
▁factors	-12.1924
▁rprev	-12.1929
1),	-12.1931
▁maxsum	-12.1951
usa	-12.1955
▁'2')	-12.1979
▁""4	-12.198
[2].	-12.1994
▁2.0	-12.2
cto	-12.2005
▁niz	-12.2043
Ma	-12.2049
▁child	-12.2057
▁odds	-12.2072
▁nas	-12.2075
▁50;	-12.211
▁gh	-12.2116
▁kh	-12.2121
▁colors	-12.2127
▁ite	-12.2135
(0.0);	-12.2137
inv	-12.2139
itr	-12.2204
[2][1])	-12.2239
▁band	-12.2251
#.#.#.|.|)""	-12.2266
▁((1	-12.2271
▁block	-12.2301
▁app	-12.2302
(*	-12.2316
eight	-12.2322
000000005	-12.2327
_4	-12.2339
isupper	-12.234
eaten	-12.2342
beat	-12.2343
book	-12.2344
def	-12.2347
▁0.0	-12.235
chat	-12.2354
#.#.#.|.|""	-12.2358
▁caso	-12.2375
▁face	-12.2379
ways	-12.2381
Mar	-12.239
.#.#.#.#.#.#.|	-12.2393
▁fo	-12.2393
bru	-12.2397
ber	-12.2398
▁blu	-12.2399
▁mindis	-12.2399
.#.#.|	-12.24
.#.|	-12.24
.#.#.#.|	-12.24
▁brainfuck	-12.24
▁encrypt	-12.24
▁maxExcl	-12.24
erosOnes	-12.24
▁File	-12.24
▁ziro	-12.24
▁trump	-12.24
(""0"")	-12.24
▁mohi	-12.24
▁highest	-12.2402
[8][8]	-12.2403
▁merge	-12.2403
▁null	-12.2403
▁umb	-12.2404
▁200100	-12.2404
une	-12.2404
▁mius	-12.2405
minmum	-12.2407
[13]	-12.2408
▁rides	-12.2408
▁jol	-12.2409
ept	-12.241
▁prim	-12.2411
▁huruf	-12.2411
▁busca	-12.2411
▁mole	-12.2412
▁"":""	-12.2412
▁dict	-12.2412
▁foot	-12.2416
anu	-12.2417
▁welfare	-12.2418
▁limak	-12.2421
▁xorr	-12.2423
▁Start	-12.2425
▁minIncl	-12.2425
▁pntr	-12.2425
▁perm	-12.2426
▁maks	-12.2426
sir	-12.2427
▁path	-12.2431
▁']'	-12.2433
']['	-12.2443
▁Num	-12.2445
▁matching	-12.2455
▁soma	-12.2456
▁cntfloat	-12.246
▁main	-12.2465
.#.#.#.#.|	-12.2471
▁od	-12.2511
▁gov	-12.2515
▁sym	-12.2516
▁pet	-12.2519
▁csx	-12.2521
.#.#.#.#.#.|	-12.254
▁Dp	-12.2551
▁las	-12.2555
▁till	-12.2564
▁rock	-12.2577
9"	-12.2616
[105][105]	-12.2619
[0][0],	-12.2619
▁1][2]))	-12.2626
can	-12.2654
▁xsum	-12.2665
[2001];	-12.2674
[1]))	-12.2694
▁gs	-12.2719
▁lin	-12.2722
▁charnum	-12.2753
▁fp	-12.2759
startx	-12.2835
▁100002	-12.2849
maxs	-12.2851
▁'{'	-12.2877
point	-12.29
TOWARDS	-12.2925
[35]	-12.293
decimal	-12.2931
good	-12.2932
down	-12.2932
▁101;	-12.2934
▁jwb	-12.2934
dig	-12.2937
acos	-12.2944
▁choc	-12.2957
fact	-12.2962
tam	-12.2971
▁byte	-12.2973
▁righ	-12.2977
▁lines	-12.2983
▁maxc	-12.2985
Gym	-12.2988
Infinite	-12.2988
▁assert	-12.2988
▁maxCol	-12.2988
▁maxRow	-12.2988
▁minCol	-12.2988
▁minRow	-12.2988
▁olnum	-12.2988
▁indimpar	-12.2988
(""1"")	-12.2989
▁indpar	-12.2989
[15][15]	-12.299
▁lenght	-12.299
▁malloc	-12.299
▁numPairs	-12.299
▁this	-12.2991
▁era	-12.2992
▁initial	-12.2993
.0	-12.2996
odo	-12.2996
▁orgStr	-12.2997
▁posiciones	-12.2997
▁stud	-12.2999
▁lvl	-12.2999
▁findfa	-12.3
▁stck	-12.3002
▁Yellow	-12.3004
▁lft	-12.3004
▁tep	-12.3006
▁MAT	-12.301
▁midTime	-12.3012
[1001][1001]	-12.3012
▁before	-12.3013
▁candidate	-12.3014
▁tra	-12.3021
▁nike	-12.3021
▁flat	-12.3025
▁Cb	-12.3033
do	-12.3033
ada	-12.3035
▁seed	-12.3051
▁fingers	-12.3052
▁stat	-12.3057
▁jumps	-12.3061
[2005]	-12.3063
▁ptr	-12.3065
▁fim	-12.307
▁syl	-12.3072
(12)	-12.3073
[500];	-12.3078
5,	-12.3097
▁hari	-12.3097
xor	-12.3099
far	-12.3131
▁taken	-12.3133
▁90)	-12.3139
▁Bob	-12.3144
▁Alice	-12.3147
▁nam	-12.3162
▁bul	-12.3191
▁mass	-12.3192
(8);	-12.3225
[12];	-12.3238
▁sam	-12.3248
▁97]	-12.3255
ul	-12.3257
▁2));	-12.3263
▁gp	-12.3271
▁ro	-12.3274
▁hj	-12.3275
▁sorted	-12.3276
▁27)	-12.332
▁1000006	-12.3358
nd	-12.3383
▁Mina	-12.3395
'};	-12.3397
▁4)]	-12.3402
even	-12.3403
15	-12.3406
▁ry	-12.3435
▁50)	-12.3462
[11][11];	-12.3473
▁exa	-12.3477
▁maxcount	-12.3511
lose	-12.3535
▁((2	-12.3536
file	-12.3546
Finite	-12.3547
leafeon	-12.3551
prefix	-12.3552
flareon	-12.3552
sylveon	-12.3552
umbreon	-12.3552
bacterias	-12.3555
isgro	-12.3556
search	-12.3556
tolower	-12.3557
power	-12.3557
diag	-12.3557
▁1][0])	-12.3558
distance	-12.356
pass	-12.3561
gov	-12.3561
gr	-12.3568
3);	-12.3572
▁maxle	-12.3588
buil	-12.3593
▁10001	-12.3595
▁2000000000	-12.3611
getFactorization	-12.3613
▁ganjil	-12.3613
urantsLunchTimes	-12.3613
▁amazing	-12.3613
▁blanco	-12.3613
▁destination	-12.3613
▁negro	-12.3613
▁occurances	-12.3613
▁wynik	-12.3613
▁FindLen	-12.3613
▁momo	-12.3613
[10000000]	-12.3613
▁salir	-12.3613
▁tpresents	-12.3613
▁gotodown	-12.3613
▁nogover	-12.3613
[40]	-12.3613
▁lowest	-12.3613
▁-2019	-12.3614
▁tramp	-12.3614
Dec	-12.3614
▁colCount	-12.3614
▁fastio	-12.3615
hase	-12.3615
inner	-12.3615
▁previousConte	-12.3615
▁iskom	-12.3615
▁nilai	-12.3616
Count	-12.3618
▁passengers	-12.3619
▁slice	-12.3619
▁valori	-12.3619
▁divisores	-12.3619
▁city	-12.3619
▁adder	-12.3622
debug	-12.3622
▁profits	-12.3622
▁wrong	-12.3622
▁posibles	-12.3626
▁Chess	-12.3626
▁frr	-12.3627
▁4000	-12.3628
▁coin	-12.3633
▁minute	-12.3633
▁lime	-12.3636
-1-	-12.3644
▁256	-12.3647
▁load	-12.365
▁1111	-12.3654
table	-12.3661
▁checker	-12.3667
▁suf	-12.3667
oys	-12.3669
▁eaten	-12.3679
▁cCount	-12.3681
▁vl	-12.3683
▁1.0))	-12.3687
4)	-12.3691
=1000000007	-12.3691
▁ru	-12.3692
▁cast	-12.3693
01	-12.3727
▁cdays	-12.3729
▁""8""	-12.3735
▁'3')	-12.3741
go	-12.3741
28	-12.3743
Ans	-12.375
+3	-12.3761
▁sel	-12.3761
▁gb	-12.3764
▁nimpar	-12.3774
▁maxnum	-12.3775
▁timer	-12.3793
side	-12.3809
tin	-12.3815
(((3	-12.3838
[1]--;	-12.385
▁Tie	-12.3856
][1],	-12.3858
rt	-12.3875
▁(__	-12.3877
▁""[]""	-12.3878
[20]	-12.3879
▁vm	-12.3902
pw	-12.391
ngh	-12.3924
▁100000000	-12.3926
▁rla	-12.3931
▁pm	-12.3942
son	-12.3957
[101][101]	-12.3958
▁jjj	-12.3979
gh	-12.398
otes	-12.3993
▁ifstream	-12.4007
▁divi	-12.4017
▁ops	-12.4022
▁cmax	-12.4045
▁ho	-12.405
▁99999999	-12.4078
[2000];	-12.4086
▁rank	-12.4094
abc	-12.4102
▁3000	-12.4107
maxy	-12.4109
)/2	-12.4131
ha	-12.4145
ncr	-12.4165
tab	-12.418
discount	-12.4183
▁npar	-12.4185
Len	-12.4209
Total	-12.4214
8""	-12.4216
glaceon	-12.4219
jolteon	-12.4219
▁six	-12.422
cap	-12.4233
arg	-12.424
coun	-12.4241
spf	-12.4242
240	-12.4253
ele	-12.4254
-1]+	-12.4258
▁bill	-12.4259
▁24;	-12.4267
▁norm	-12.4272
incremented	-12.4276
State	-12.428
▁capital	-12.428
wheniEndFromLeft	-12.428
▁indefinitely	-12.428
▁kecil	-12.428
▁getChar	-12.428
▁woch	-12.428
▁getAns	-12.428
▁losp	-12.4281
▁patt	-12.4282
▁shelves	-12.4282
▁nrod	-12.4282
▁restaurants	-12.4282
▁losn	-12.4282
▁actual	-12.4286
▁minimun	-12.4286
▁chance	-12.4286
▁maap	-12.4287
▁izq	-12.4289
▁Primes	-12.429
▁spyke	-12.429
▁spykeId	-12.429
▁Freq	-12.429
▁yelo	-12.429
▁Ids	-12.429
▁1][1])	-12.429
▁tipe	-12.429
▁groups	-12.429
▁Res	-12.4291
ifstream	-12.4292
▁boox	-12.4294
▁texto	-12.4296
bus	-12.4301
▁blockb	-12.4303
▁mima	-12.4305
▁NULL	-12.4306
mode	-12.4307
-3]	-12.4307
[51][51];	-12.4311
▁press	-12.4313
▁loser	-12.4314
▁mot	-12.4316
▁compari	-12.4323
▁target	-12.4323
▁rtn	-12.4328
▁100009	-12.4332
▁Ta	-12.4336
▁-1000	-12.4337
Sum	-12.4342
est	-12.4342
▁blocka	-12.4344
le	-12.4356
item	-12.436
▁tmpb	-12.4376
[400];	-12.4377
▁but	-12.4383
▁works	-12.4389
bal	-12.4392
ement	-12.4395
+5	-12.4398
▁cprice	-12.4402
[305];	-12.4413
[0][1];	-12.4427
▁prevr	-12.4429
▁un	-12.4435
▁scored	-12.4444
▁prefs	-12.4457
▁minval	-12.4459
Pos	-12.4473
▁'}')	-12.4479
▁110;	-12.4481
▁terminate	-12.4501
-1)/2	-12.4506
▁(-1	-12.4515
▁iterations	-12.452
▁1000000001	-12.4522
[10][10]	-12.4537
um	-12.4558
▁letterx	-12.4567
▁incremented	-12.4569
▁19	-12.4574
▁inc	-12.4595
SI	-12.4599
[200000];	-12.4611
hi	-12.4615
▁post	-12.4626
lower	-12.464
[2001]	-12.4649
▁'>')	-12.4652
3++;	-12.4664
8;	-12.4671
▁::	-12.4679
▁4))	-12.4704
votes	-12.4711
[111];	-12.4739
]++	-12.474
▁added	-12.474
▁comb	-12.4747
▁'0'))	-12.4761
▁pB	-12.4805
▁lenp	-12.4821
▁'_'	-12.4826
▁minp	-12.4831
ake	-12.4838
▁10000000000	-12.4873
▁57	-12.4914
▁2010	-12.4929
▁qy	-12.4932
require	-12.4935
checker	-12.4937
black	-12.4937
graph	-12.4938
remainder	-12.4938
pointer	-12.4938
MOD	-12.4939
seq	-12.4943
▁7);	-12.4946
flg	-12.4947
▁5001;	-12.4954
▁che	-12.4959
][0],	-12.496
ry	-12.4974
uantity	-12.4978
▁sheet	-12.4981
Star	-12.4982
elv	-12.4985
klmnopqrstuvwxyz	-12.4994
▁numeric	-12.4994
▁DeleteIt	-12.4994
▁fristOven	-12.4994
▁thisChar	-12.4994
▁ttoalha	-12.4994
▁girl	-12.4994
▁toalha	-12.4994
▁Init	-12.4994
▁starCount	-12.4994
▁seive	-12.4994
▁invfact	-12.4994
▁tConOven	-12.4996
▁borrow	-12.4996
▁bucket	-12.4996
▁tiga	-12.4997
▁besar	-12.4997
▁masha	-12.4998
[50][50]	-12.4999
▁banyakganjil	-12.5001
▁ganjilterkecil	-12.5001
▁tedad	-12.5001
▁Roz	-12.5001
▁100007	-12.5001
▁tren	-12.5002
▁distinct	-12.5005
▁strength	-12.5005
▁buy	-12.5007
▁444	-12.5008
▁PhoneArray	-12.5009
▁cube	-12.5009
▁hot	-12.5016
▁strArr	-12.5017
▁pearls	-12.5017
▁99	-12.5018
▁fre	-12.5019
/2)	-12.5019
▁kpk	-12.502
ither	-12.502
▁mcd	-12.5023
▁bulbs	-12.5025
▁piso	-12.5029
[210]	-12.5031
▁ey	-12.5031
▁lock	-12.5031
▁encontrado	-12.5035
▁faces	-12.504
▁nextz	-12.5045
sp	-12.5052
▁cyc	-12.5064
▁gv	-12.5066
fix	-12.5074
▁println	-12.5076
dis	-12.5076
er	-12.5078
▁rate	-12.5083
▁mCount	-12.5088
▁goo	-12.5092
▁viii	-12.51
▁360;	-12.51
▁dic	-12.5106
[15];	-12.5113
1}	-12.5113
▁colom	-12.5114
▁fib	-12.5121
ghi	-12.5122
sup	-12.5132
indx	-12.5139
chars	-12.5152
▁got	-12.5173
▁did	-12.5181
▁TIE	-12.5186
lt	-12.5186
[2]++;	-12.5187
numbers	-12.5188
▁Equal	-12.5214
▁nok	-12.5222
duo	-12.5223
0000000000000000	-12.5231
▁subtraction	-12.5242
▁ha	-12.5244
▁purple	-12.526
▁countb	-12.5267
[--	-12.5272
[1]);	-12.5277
▁1100	-12.5297
▁nom	-12.5302
times	-12.5308
▁greate	-12.5323
[9];	-12.533
▁pal	-12.5337
▁-100	-12.5338
vocale	-12.5348
[7];	-12.5371
(7	-12.5373
▁10))	-12.5385
▁gox	-12.5387
110	-12.5404
pq	-12.5423
[5000]	-12.5431
-1][0]	-12.5449
(5	-12.5498
▁1007	-12.5516
my	-12.5525
]]--;	-12.5527
ms	-12.5533
▁32)	-12.554
('-')	-12.5541
▁jmin	-12.5544
cp	-12.5554
(180	-12.5555
[205]	-12.5561
[505];	-12.5588
▁100005;	-12.5589
hang	-12.5597
▁((3	-12.5602
maxm	-12.5604
}]	-12.5606
▁minA	-12.5607
aea	-12.5622
▁oc	-12.5635
▁'='	-12.5667
vote	-12.5667
move	-12.5672
▁jmax	-12.5674
▁PRINT	-12.5675
▁((((	-12.5679
31,	-12.5696
coins	-12.57
acef	-12.57
numa	-12.5706
slot	-12.5706
node	-12.5707
speed	-12.5707
save	-12.5707
buff	-12.571
'6'	-12.5714
▁leave	-12.5728
(26	-12.5734
imak	-12.5748
▁join	-12.5751
XXL	-12.5755
pple	-12.5756
dsa	-12.5758
currnum	-12.5758
(':')	-12.5763
isTrue	-12.5763
▁Otherwise	-12.5763
▁infinity	-12.5763
▁itung	-12.5763
▁DashaCount	-12.5763
▁supply	-12.5763
[100007]	-12.5763
▁itself	-12.5764
edges	-12.5764
strgro	-12.5764
▁CityCode	-12.5766
▁consecutive	-12.5766
▁diamond	-12.5766
▁sleepTime	-12.5766
▁insect	-12.5766
▁edits	-12.5766
▁Long	-12.5766
▁quit	-12.5766
▁kount	-12.5766
▁shit	-12.5767
▁blocked	-12.5768
▁numerator	-12.5768
▁\0	-12.577
▁javab	-12.5771
▁safe	-12.5771
▁failed	-12.5771
ogo	-12.5772
▁FB	-12.5774
▁esPrimo	-12.5775
▁ivmind	-12.5775
▁1024	-12.5777
[200][200]	-12.578
▁300005	-12.578
▁mayor	-12.578
▁prevI	-12.5782
▁trig	-12.5782
▁Move	-12.5784
▁cities	-12.5784
▁myString	-12.5784
▁shapes	-12.5784
▁rub	-12.5787
/2+1	-12.5792
▁delet	-12.5792
ff	-12.5792
▁MAXX	-12.5794
▁packs	-12.5798
▁prod	-12.58
▁lift	-12.5804
▁MAXM	-12.5805
▁maxlevel	-12.5806
▁offset	-12.5809
▁impar	-12.581
▁ang	-12.581
▁modpow	-12.5811
▁Size	-12.5813
▁jav	-12.5818
▁sumodd	-12.582
words	-12.5825
▁1000)	-12.5827
▁bacterias	-12.5836
▁eight	-12.5846
ad	-12.5848
▁cry	-12.5849
▁pages	-12.5856
]-'	-12.5866
▁amounts	-12.5879
▁1500	-12.5901
▁amt	-12.592
6,	-12.5933
10;	-12.5937
[1005][1005];	-12.5941
▁boy	-12.5955
[205];	-12.5969
▁maxval	-12.597
▁years	-12.597
Num	-12.5973
▁floats	-12.5984
▁anses	-12.5989
ay	-12.5992
▁MD	-12.6
▁63	-12.6
▁""()""	-12.601
▁format	-12.6012
('0')	-12.6012
substring	-12.6026
▁2.0)	-12.6028
tem	-12.6029
▁isvowel	-12.6032
▁scoreb	-12.604
▁numD	-12.6046
biggest	-12.6051
▁bad	-12.6054
▁mpu	-12.6072
▁Penny	-12.6079
▁kmax	-12.6096
▁say	-12.6096
[200001]	-12.611
▁nnp	-12.6117
▁chr	-12.6129
▁gmax	-12.6129
sy	-12.6139
▁tlen	-12.6154
ones	-12.6167
cl	-12.6174
▁ccnt	-12.6178
▁maxC	-12.6189
[52]	-12.619
▁msum	-12.6191
[5005];	-12.6198
▁ww	-12.62
▁cntb	-12.6203
[200001];	-12.6233
▁dq	-12.6271
TE	-12.6288
dd	-12.6301
.#.#.#.#.#.|.|)	-12.6315
▁12]	-12.6325
ame	-12.6336
▁bst	-12.6337
el	-12.6362
▁998244353)	-12.6374
+1))	-12.6376
▁mnd	-12.6379
[25]	-12.6388
▁faktor	-12.6402
▁rai	-12.6422
▁""--	-12.6483
command	-12.6503
▁eat	-12.6511
shel	-12.6522
possible	-12.654
kanan	-12.654
gesture	-12.654
present	-12.654
chess	-12.654
prog	-12.6542
boolean	-12.6542
seg	-12.6543
subtract	-12.6546
lcm	-12.6546
sol	-12.655
▁pack	-12.6562
ment	-12.6569
▁aes	-12.6571
vasya	-12.6585
▁cons	-12.6595
XXS	-12.6595
▁Random	-12.6597
▁perlas	-12.6597
getPossibilities	-12.6597
▁denominador	-12.6597
▁direcciones	-12.6597
▁lunchBreakTime	-12.6597
▁maxgro	-12.6597
▁ndmny	-12.6597
▁numOfTestCases	-12.6597
▁perRowColor	-12.6597
▁MODULO	-12.6597
▁agua	-12.6597
▁getNextGap	-12.6597
▁tagua	-12.6597
▁alana	-12.6597
▁consume	-12.6597
▁buns	-12.6597
▁chrColor	-12.6597
▁term	-12.6597
▁mean	-12.6597
